# 9. 데이터 선택 (조건)

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col = '지원번호')
df

       이름   학교   국어   영어   수학   과학   사회    SW특기
지원번호
1번    강민수  세종초  100   85  100   85  100  Python
2번    배성현  포항초   95   90   95   90   95       C
3번    박세환  동탄초   90   95   90   95   90     C++
4번    정태경  덕소초   85  100   85  100   85     NaN

In [2]:
df['국어'] >= 95 #학생들의 성적이 95이상인지 확인

지원번호
1번     True
2번     True
3번    False
4번    False
Name: 국어, dtype: bool

In [3]:
filt = df['국어'] >= 95
df[filt]

       이름   학교   국어  영어   수학  과학   사회    SW특기
지원번호
1번    강민수  세종초  100  85  100  85  100  Python
2번    배성현  포항초   95  90   95  90   95       C

In [4]:
df[~filt] #filter를 역으로 적용

       이름   학교  국어   영어  수학   과학  사회 SW특기
지원번호
3번    박세환  동탄초  90   95  90   95  90  C++
4번    정태경  덕소초  85  100  85  100  85  NaN

In [5]:
df[df['국어'] >= 95]

       이름   학교   국어  영어   수학  과학   사회    SW특기
지원번호
1번    강민수  세종초  100  85  100  85  100  Python
2번    배성현  포항초   95  90   95  90   95       C

In [6]:
df.loc[df['국어'] >=95, '수학'] #국어 95이상인 사람의 수학데이터

지원번호
1번    100
2번     95
Name: 수학, dtype: int64

In [7]:
df.loc[df['국어']>=95,['이름', '수학', '과학']] #국어성적이 95이상인 학생들의 이름,수학,과학

       이름   수학  과학
지원번호
1번    강민수  100  85
2번    배성현   95  90

## 다양한 조건
### & 그리고

In [8]:
df.loc[(df['국어'] >=95) & (df['학교'] == '세종초')]#국어 95이상인 세종초 학생 데이터

       이름   학교   국어  영어   수학  과학   사회    SW특기
지원번호
1번    강민수  세종초  100  85  100  85  100  Python

### | 또는

In [9]:
df.loc[(df['국어']>=95)|(df['국어'] <= 85)] #국어 성적이 95이상이거나 85이하인 학생 데이터

       이름   학교   국어   영어   수학   과학   사회    SW특기
지원번호
1번    강민수  세종초  100   85  100   85  100  Python
2번    배성현  포항초   95   90   95   90   95       C
4번    정태경  덕소초   85  100   85  100   85     NaN

## str 함수

In [10]:
filt = df['이름'].str.startswith('강') #'강'씨 성을 가진 사람
df[filt]

       이름   학교   국어  영어   수학  과학   사회    SW특기
지원번호
1번    강민수  세종초  100  85  100  85  100  Python

In [11]:
filt = df['이름'].str.contains('태') #이름에 '태'가 들어가는 사람
df[filt]

       이름   학교  국어   영어  수학   과학  사회 SW특기
지원번호
4번    정태경  덕소초  85  100  85  100  85  NaN

In [12]:
df[~filt] #이름에 '태'가 들어가는 사람을 제외

       이름   학교   국어  영어   수학  과학   사회    SW특기
지원번호
1번    강민수  세종초  100  85  100  85  100  Python
2번    배성현  포항초   95  90   95  90   95       C
3번    박세환  동탄초   90  95   90  95   90     C++

In [13]:
langs = ["Python", "C"]
filt = df['SW특기'].isin(langs) #SW특기가 Python 이거나 C인사람
df[filt]

       이름   학교   국어  영어   수학  과학   사회    SW특기
지원번호
1번    강민수  세종초  100  85  100  85  100  Python
2번    배성현  포항초   95  90   95  90   95       C

In [14]:
langs = ["python", "java"]
filt = df['SW특기'].str.lower().isin(langs) #소문자로 변환하여 비교 한 후 결과값 도출
df[filt]

       이름   학교   국어  영어   수학  과학   사회    SW특기
지원번호
1번    강민수  세종초  100  85  100  85  100  Python

In [15]:
df['SW특기'].str.contains('Python')

지원번호
1번     True
2번    False
3번    False
4번      NaN
Name: SW특기, dtype: object

In [16]:
df['SW특기'].str.contains('Python', na=True) #Nan 데이터에 대해서 True로 설정

지원번호
1번     True
2번    False
3번    False
4번     True
Name: SW특기, dtype: bool

In [17]:
df['SW특기'].str.contains('Python', na=False) #Nan 데이터에 대해서 False로 설정

지원번호
1번     True
2번    False
3번    False
4번    False
Name: SW특기, dtype: bool

In [18]:
filt = df['SW특기'].str.contains('Python', na=False) #Nan을 처리하기위해 Nan데이터는 False로 처리한다.
df[filt]

       이름   학교   국어  영어   수학  과학   사회    SW특기
지원번호
1번    강민수  세종초  100  85  100  85  100  Python